Detect Suspicious Command Execution to Disable Security and Application Event Logging

Description: Disable Security and Application Event Logging" refers to a configuration or action that stops the operating system (typically Windows) from recording certain types of events in its event logs — specifically:
Security Event Logs: These include critical logs like login attempts, file access auditing, privilege use, etc. 
Application Event Logs: These record events generated by applications, such as errors, warnings, or informational messages.

This query detects the threat actors that attempt to disable security event logging to evade further investigation process.

References: https://research.checkpoint.com/2025/funksec-alleged-top-ransomware-group-powered-by-ai/

DeviceProcessEvents
| where FileName in ('wevtutil.exe')
| where ProcessCommandLine has_all ('sl', 'Security', 'false') or  ProcessCommandLine has_all ('sl', 'Application', 'false')
| project Timestamp, AccountName, DeviceName,DeviceId,ReportId, InitiatingProcessFileName, InitiatingProcessCommandLine, FileName, ProcessCommandLine
